[
    {
        "id":"sullengard_hidden",
        "name":"sullengard_nondisplay",
        "stages":[
            {
                "progress":1,
                "logText":"bought Sullengard bed"
            },
            {
                "progress":10,
                "logText":"Pat or Tickle baby's tummy.",
                "rewardExperience":100
            },
            {
                "progress":20,
                "logText":"Umar gave player a 1,000 gold coins as a financial contribution from Thieves Guild."
            },
            {
                "progress":30,
                "logText":"The promised share has been restored."
            },
            {
                "progress":2,
                "logText":"The player has seen the tavern's menu"
            },
            {
                "progress":3,
                "logText":"I need to leave the Sullengard tavern"
            }
        ]
    },
    {
        "id":"deebo_orchard_hth",
        "name":"Hunting the hunter",
        "stages":[
            {
                "progress":0,
                "logText":"Deebo, the apple orchard farmer northeast of Sullengard has informed me of a Golden jackal that is wreaking havoc on his orchard."
            },
            {
                "progress":10,
                "logText":"I have accepted the challenge of tracking down the Golden jackal and bringing back proof to Deebo that I have killed it."
            },
            {
                "progress":40,
                "logText":"I have killed the Golden jackal. I need to return to Deebo with the Golden jackal's fur as prrof that I've killed it."
            },
            {
                "progress":50,
                "logText":"I returned to Deebo with the  killed the Golden jackal's fur as prrof that I've killed it. He is now willing to trade with me.",
                "rewardExperience":5000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"deebo_orchard_ght",
        "name":"Getting home on time",
        "stages":[
            
        ]
    },
    {
        "id":"sullengard_pond_safety",
        "name":"Pond safety",
        "stages":[
            {
                "progress":10,
                "logText":"Nanette is troubled for her pond unsafe because of the monsters emerged in the pond. "
            },
            {
                "progress":20,
                "logText":"I accepted her request to clear out the monsters in her pond area so that she can enjoy the pond again."
            },
            {
                "progress":30,
                "logText":"I have now cleared the pond area. Nanette told me that I should talk to Kaelwea, the priest of Sullengard, to see if he has some information about the cause of the monster's appearance in the pond area."
            },
            {
                "progress":40,
                "logText":"The priest Kaelwea told me a story about his strange experience same as Nanette's experience in the pond area. I better tell her the moral story of it."
            },
            {
                "progress":50,
                "logText":"I told Nanette the moral of the story. She had already learned from her mistake and she promised never to do it again just to release her anger issue against unfair taxes of Feygard.",
                "rewardExperience":2000,
                "finishesQuest":1
            }
        ]
    }
]