[
    {
        "id":"sullengard_hidden",
        "name":"sullengard_nondisplay",
        "stages":[
            {
                "progress":1,
                "logText":"bought Sullengard bed"
            },
            {
                "progress":101,
                "logText":"Pat or Tickle baby's tummy.",
                "rewardExperience":100
            },
            {
                "progress":2,
                "logText":"The player has seen the tavern's menu"
            },
            {
                "progress":3,
                "logText":"I need to leave the Sullengard tavern"
            },
            {
                "progress":4,
                "logText":"The golden jackal has spawned."
            },
            {
                "progress":5,
                "logText":"Picked poisonous mushroom in sullengard_woods14"
            },
            {
                "progress":6,
                "logText":"sullengard6_replace_below"
            },
            {
                "progress":7,
                "logText":"6=sullengard6_replace_above"
            },
            {
                "progress":8,
                "logText":"sullengard5_replace_below"
            },
            {
                "progress":9,
                "logText":"sullengard5_replace_above"
            },
            {
                "progress":10,
                "logText":"sullengard7_replace_below"
            },
            {
                "progress":11,
                "logText":"sullengard7_replace_above"
            },
            {
                "progress":12,
                "logText":"sullengard9_replace_below"
            },
            {
                "progress":13,
                "logText":"sullengard9_replace_above"
            },
            {
                "progress":14,
                "logText":"sullengard10_replace_below"
            },
            {
                "progress":15,
                "logText":"sullengard10_replace_above"
            },
            {
                "progress":16,
                "logText":"Player has talked with Hadena."
            },
            {
                "progress":17,
                "logText":"Player is helping Grazia cross the bridge"
            },
            {
                "progress":18,
                "logText":"Player has helped Grazia cross the bridge.",
                "rewardExperience":200
            },
            {
                "progress":19,
                "logText":"The player has been to Sullengard."
            },
            {
                "progress":100,
                "logText":"I successfully lifted up the pitchfork from the haystack."
            },
            {
                "progress":500,
                "logText":"Key: (Never true condition)"
            },
            {
                "progress":20,
                "logText":"Nimael is preparring the Gloriosa soup."
            },
            {
                "progress":21,
                "logText":"Nimael has finished the preperation of the Gloriosa soup."
            },
            {
                "progress":22,
                "logText":"Player has gained the Gloriosa soup."
            },
            {
                "progress":23,
                "logText":"The PC has asked the 'three drinking brothers' if they have seen or know anything about the armory theft."
            },
            {
                "progress":24,
                "logText":"The PC has asked Lamberta if she had seen or knew anything about the armory theft."
            },
            {
                "progress":25,
                "logText":"The PC has asked Mayor Ale  if he had seen or knew anything about the armory theft."
            },
            {
                "progress":26,
                "logText":"The PC listen to the entire argument between Valentina and Mikhail."
            },
            {
                "progress":27,
                "logText":"The PC has admired the magnificent trees of the Sullengard forest."
            },
            {
                "progress":28,
                "logText":"Umar gave player a 1,000 gold coins as a financial contribution from Thieves Guild."
            },
            {
                "progress":29,
                "logText":"The PC has made it across the ravine bridge without helping Grazia."
            },
            {
                "progress":30,
                "logText":"The promised share has been restored."
            }
        ]
    },
    {
        "id":"deebo_orchard_hth",
        "name":"Hunting the hunter",
        "showInLog":1,
        "stages":[
            {
                "progress":0,
                "logText":"Deebo, the apple orchard farmer northeast of Sullengard has informed me of a Golden jackal that is wreaking havoc on his orchard."
            },
            {
                "progress":10,
                "logText":"I have accepted the challenge of tracking down the Golden jackal and bringing back proof to Deebo that I have killed it."
            },
            {
                "progress":40,
                "logText":"I have killed the Golden jackal. I need to return to Deebo with the Golden jackal's fur as prrof that I've killed it."
            },
            {
                "progress":50,
                "logText":"I returned to Deebo with the killed the Golden jackal's fur as prrof that I've killed it. He is now willing to trade with me.",
                "rewardExperience":5000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"deebo_orchard_ght",
        "name":"Getting home on time",
        "stages":[
            {
                "progress":10,
                "logText":"Hadena needs my help to get her husband Ainsley home on time."
            },
            {
                "progress":20,
                "logText":"I agreed to help Hadena with getting her husband Ainsley home on time. He is working at Deebo's Orchard located southwest of their cabin."
            },
            {
                "progress":25,
                "logText":"Due to the vast distance to Loneford and the monsters that he would encounter along the way, Ainsley has asked me to go to Lonefordand retrieve him a new pitchfork."
            },
            {
                "progress":30,
                "logText":"Throthaus wants me to pull out his pitchfork from the haystack to prove that I'm a son of a farmer."
            },
            {
                "progress":40,
                "logText":"I successfully pulled out the pitchfork. It's time to visit Ainsley again working in Deebo's Orchard in Sullengard."
            },
            {
                "progress":50,
                "logText":"I gave Ainsley the new pitchfork. I should tell Hadena about this."
            },
            {
                "progress":60,
                "logText":"Hadena is so grateful to me for helping them.",
                "rewardExperience":2500,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"sullengard_pond_safety",
        "name":"Pond safety",
        "stages":[
            {
                "progress":10,
                "logText":"Nanette is troubled for her pond unsafe because of the monsters emerged in the pond. "
            },
            {
                "progress":20,
                "logText":"I accepted her request to clear out the monsters in her pond area so that she can enjoy the pond again."
            },
            {
                "progress":30,
                "logText":"I have now cleared the pond area. Nanette told me that I should talk to Kaelwea, the priest of Sullengard, to see if he has some information about the cause of the monster's appearance in the pond area."
            },
            {
                "progress":40,
                "logText":"The priest Kaelwea told me a story about his strange experience same as Nanette's experience in the pond area. I better tell her the moral story of it."
            },
            {
                "progress":50,
                "logText":"I told Nanette the moral of the story. She had already learned from her mistake and she promised never to do it again just to release her anger issue against unfair taxes of Feygard.",
                "rewardExperience":2000,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"sullengard_recover_items",
        "name":"Recovering stolen property",
        "stages":[
            {
                "progress":10,
                "logText":"I've agreed to help the armour shop owner, Zaccheria investigate the theft of his shop's entire inventory."
            },
            {
                "progress":20,
                "logText":"Zaccheria suggests that I start my investigation by speaking with Gaelian from the Briwerra family."
            },
            {
                "progress":30,
                "logText":"I have spoke with Gaelian from the Briwerra and I suspect that he has nothing to do with this crime."
            },
            {
                "progress":40,
                "logText":"I spoke with Prowling Arantxa, a thief in the Sullengard tavern basement and she informed me that the 'lost traveler' recently tried to sell her some items that she recgonized as belonging to Zaccheria.\nI should speak with the 'lost traveler'."
            },
            {
                "progress":50,
                "logText":"I have paid the 'lost traveler' in exhanchage for the location of Zaccheria's stolen items. He told me that he hid them on the eastern boundaries of town."
            },
            {
                "progress":60,
                "logText":"I found the stolen items and should return to Zaccheria with them."
            },
            {
                "progress":70,
                "logText":"Zaccheria was very happy that I was able to return his items to him. He paid me a very nice reward in gold.",
                "rewardExperience":3800,
                "finishesQuest":1
            }
        ]
    },
    {
        "id":"beer_bootlegging",
        "name":"Beer Bootlegging",
        "showInLog":1,
        "stages":[
            {
                "progress":10,
                "logText":"I've agreed to help the Faygard patrol captain investigate why there is so much beer on the Foaming flask tavern property."
            },
            {
                "progress":20,
                "logText":"After bribing Torilo, the owner of the Floaming flask, he states that he and other tavern owners have a 'business agreement' with a group of 'distributors'. He suggests that I ask other tavern owners for more information."
            },
            {
                "progress":30,
                "logText":"After bribing Tharwyn, the owner of the Vilegard tavern, he states as part of his 'business agreement', Dunla, the local thief, is his 'distributors'. He suggests that I talk to him."
            },
            {
                "progress":40,
                "logText":"Dunla, the thief in Vilegard has instructed me to speak with Farrick if I want to learn more about the tavern owner's 'business agreement' with their 'distributors'."
            },
            {
                "progress":50,
                "logText":"Farrik has told me that the beer is coming from Sullengard. I really should go there next."
            },
            {
                "progress":60,
                "logText":"To earn his trust, Mayor Ale has asked that I deliver his letter to Kealwea, the Sullengard priest."
            },
            {
                "progress":70,
                "logText":"I have done what Mayor Ale has asked of me as I have delivered his letter. I should now return to him."
            },
            {
                "progress":80,
                "logText":"Mayor Ale has explained everything to me about the 'business agreement' with the Thieves guild. I should head back to the Floaming flask tavern and speak with the captain."
            },
            {
                "progress":90,
                "logText":"I informed the guard captain at the Floaming flask tavern all about the beer bootlegging operation.",
                "rewardExperience":5128,
                "finishesQuest":1
            },
            {
                "progress":100,
                "logText":"I informed the guard captain at the Floaming flask tavern that the beer is being distributed by the Thieves guild.",
                "rewardExperience":3109,
                "finishesQuest":1
            },
            {
                "progress":110,
                "logText":"I informed the guard captain at the Floaming flask tavern that Sullengard is responsible for brewing the beer.",
                "rewardExperience":3109,
                "finishesQuest":1
            },
            {
                "progress":120,
                "logText":"I lied to the guard captain at the Floaming flask tavern and told him nothing about the beer bootlegging operation.",
                "rewardExperience":1900,
                "finishesQuest":1
            }
        ]
    }
]